Repository: yiukitCheung/streamlit_app
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: es, fr

source: languages
es: Idiomas
fr: Langues

source: 🚪 Log Out
es: 🚪 Cerrar Sesión
fr: 🚪 Déconnexion

source: ⚙️ Settings
es: ⚙️ Configuración
fr: ⚙️ Paramètres

source: 📊 Edit Portfolio
es: 📊 Editar Cartera
fr: 📊 Modifier le Portefeuille

source: 🏠 User Dashboard
es: 🏠 Panel de Usuario
fr: 🏠 Tableau de Bord

source: 📈 Stock InDepth
es: 📈 Análisis Profundo
fr: 📈 Analyse Approfondie

source: ⚡ Fast Money
es: ⚡ Dinero Rápido
fr: ⚡ Argent Rapide

source: Back to Login
es: Volver al Inicio de Sesión
fr: Retour à la Connexion

source: Login
es: Iniciar Sesión
fr: Connexion

source: CondVest Backtest Results from 2021:
es: Resultados de Pruebas Retrospectivas de CondVest desde 2021:
fr: Résultats des Tests CondVest depuis 2021:

source: CondVest Backtest Results from 2024:
es: Resultados de Pruebas Retrospectivas de CondVest desde 2024:
fr: Résultats des Tests CondVest depuis 2024:

source: Invalid username or password
es: Usuario o contraseña inválidos
fr: Nom d'utilisateur ou mot de passe invalide

source: Please enter both username and password.
es: Por favor, ingrese usuario y contraseña.
fr: Veuillez saisir le nom d'utilisateur et le mot de passe.

source: At CondVest, our mission is to simplify the complexities of the equity market for individual investors. We believe that everyone deserves access to clear, actionable insights without the noise that often surrounds market data. By integrating, analyzing, and distilling vast amounts of financial information, we provide investors with concise, easy-to-understand alerts and insights that truly matter. By guiding investors to make smarter, well-informed decisions, CondVest aims to contribute to a more financially empowered society.
es: En CondVest, nuestra misión es simplificar las complejidades del mercado de valores para inversores individuales. Creemos que todos merecen acceso a información clara y procesable sin el ruido que suele rodear los datos del mercado. Al integrar, analizar y destilar grandes cantidades de información financiera, proporcionamos a los inversores alertas e ideas concisas y fáciles de entender que realmente importan. Al guiar a los inversores para tomar decisiones más inteligentes y bien informadas, CondVest aspira a contribuir a una sociedad más empoderada financieramente.
fr: Chez CondVest, notre mission est de simplifier les complexités du marché des actions pour les investisseurs individuels. Nous croyons que chacun mérite d'avoir accès à des informations claires et exploitables sans le bruit qui entoure souvent les données du marché. En intégrant, analysant et distillant de grandes quantités d'informations financières, nous fournissons aux investisseurs des alertes et des aperçus concis et faciles à comprendre qui comptent vraiment. En guidant les investisseurs vers des décisions plus intelligentes et éclairées, CondVest vise à contribuer à une société financièrement plus autonome.

source: Our automated alert system is powered by advanced technical analysis, designed to spotlight potential opportunities, highlight risks, and track capital flows in the market. We reduce the need for extensive due diligence, helping investors make informed decisions without the time-consuming process of sorting through overwhelming data.
es: Nuestro sistema automatizado de alertas está impulsado por análisis técnico avanzado, diseñado para destacar oportunidades potenciales, resaltar riesgos y rastrear flujos de capital en el mercado. Reducimos la necesidad de una extensa diligencia debida, ayudando a los inversores a tomar decisiones informadas sin el proceso prolongado de clasificar datos abrumadores.
fr: Notre système d'alerte automatisé est alimenté par une analyse technique avancée, conçu pour mettre en lumière les opportunités potentielles, souligner les risques et suivre les flux de capitaux sur le marché. Nous réduisons le besoin d'une due diligence approfondie, aidant les investisseurs à prendre des décisions éclairées sans le processus chronophage de tri des données accablantes.

source: Clarity Over Complexity
es: Claridad Sobre Complejidad
fr: La Clarté Plutôt que la Complexité

source: We turn intricate market data into clear, valuable insights, empowering investors to act with confidence.
es: Convertimos datos complejos del mercado en información clara y valiosa, permitiendo a los inversores actuar con confianza.
fr: Nous transformons des données de marché complexes en informations claires et précieuses, permettant aux investisseurs d'agir avec confiance.

source: Responsible Investing
es: Inversión Responsable
fr: Investissement Responsable

source: At CondVest, we prioritize helping investors build structured, low-risk trading practices, cultivating disciplined investing habits.
es: En CondVest, priorizamos ayudar a los inversores a construir prácticas comerciales estructuradas y de bajo riesgo, cultivando hábitos de inversión disciplinados.
fr: Chez CondVest, nous privilégions l'aide aux investisseurs pour construire des pratiques de trading structurées à faible risque, en cultivant des habitudes d'investissement disciplinées.

source: Investor-Centric Approach
es: Enfoque Centrado en el Inversor
fr: Approche Centrée sur l'Investisseur

source: Unlike other platforms, our goal is to support your success. We're here to help you manage your portfolio, not just presenting information.
es: A diferencia de otras plataformas, nuestro objetivo es apoyar tu éxito. Estamos aquí para ayudarte a gestionar tu cartera, no solo para presentar información.
fr: Contrairement aux autres plateformes, notre objectif est de soutenir votre succès. Nous sommes là pour vous aider à gérer votre portefeuille, pas seulement pour présenter des informations.

source: We envision a world where individual investors have the tools they need to navigate the financial markets responsibly and profitably.
es: Visualizamos un mundo donde los inversores individuales tienen las herramientas que necesitan para navegar los mercados financieros de manera responsable y rentable.
fr: Nous envisageons un monde où les investisseurs individuels disposent des outils nécessaires pour naviguer sur les marchés financiers de manière responsable et rentable.

source: By guiding investors to make smarter, well-informed decisions, CondVest aims to contribute to a more financially empowered society.
es: Al guiar a los inversores a tomar decisiones más inteligentes y bien informadas, CondVest aspira a contribuir a una sociedad más empoderada financieramente.
fr: En guidant les investisseurs vers des décisions plus intelligentes et éclairées, CondVest vise à contribuer à une société financièrement plus autonome.

source: About Us
es: Sobre Nosotros
fr: À Propos de Nous

source: Our Principles
es: Nuestros Principios
fr: Nos Principes

source: Our Vision
es: Nuestra Visión
fr: Notre Vision

source: Our Mission
es: Nuestra Misión
fr: Notre Mission

source: Forgot Password?
es: ¿Olvidaste tu Contraseña?
fr: Mot de Passe Oublié?

source: Sign Up
es: Registrarse
fr: S'inscrire

source: Log in
es: Iniciar Sesión
fr: Se Connecter

source: Choose Language
es: Elegir Idioma
fr: Choisir la Langue

source: Average Profit
es: Beneficio Promedio
fr: Profit Moyen

source: Average Loss
es: Pérdida Promedio
fr: Perte Moyenne

source: Best Trade
es: Mejor Operación
fr: Meilleur Trade

source: Worst Trade
es: Peor Operación
fr: Pire Trade

source: CondVest Alerts Performance
es: Rendimiento de Alertas CondVest
fr: Performance des Alertes CondVest

source: Please Check Us Out
es: Por Favor, Conózcanos
fr: Découvrez-nous

source: Market Health Overview
es: Resumen de Salud del Mercado
fr: Aperçu de la Santé du Marché

source: Select Instrument
es: Seleccionar Instrumento
fr: Sélectionner l'Instrument

source: Index
es: Índice
fr: Indice

source: Commodity
es: Materia Prima
fr: Matière Première

source: Bond
es: Bono
fr: Obligation

source: 30-Year Treasury Yield
es: Rendimiento del Tesoro a 30 Años
fr: Rendement du Trésor à 30 ans

source: 5-Year Treasury Yield
es: Rendimiento del Tesoro a 5 Años
fr: Rendement du Trésor à 5 ans

source: iShares Semiconductor ETF
es: ETF de Semiconductores iShares
fr: ETF iShares Semiconductor

source: Technology Select Sector SPDR
es: SPDR Sector Tecnológico
fr: SPDR Secteur Technologique

source: Health Care Select Sector SPDR
es: SPDR Sector Salud
fr: SPDR Secteur Santé

source: Financial Select Sector SPDR
es: SPDR Sector Financiero
fr: SPDR Secteur Financier

source: Consumer Staples Select Sector SPDR
es: SPDR Sector Consumo Básico
fr: SPDR Secteur Consommation de Base

source: Consumer Discretionary Select Sector SPDR
es: SPDR Sector Consumo Discrecional
fr: SPDR Secteur Consommation Discrétionnaire

source: Energy Select Sector SPDR
es: SPDR Sector Energético
fr: SPDR Secteur Énergie

source: Real Estate Select Sector SPDR
es: SPDR Sector Inmobiliario
fr: SPDR Secteur Immobilier

source: Utilities Select Sector SPDR
es: SPDR Sector Servicios Públicos
fr: SPDR Secteur Services Publics

source: Crude Oil Futures
es: Futuros de Petróleo Crudo
fr: Contrats à Terme sur le Pétrole Brut

source: Silver Futures
es: Futuros de Plata
fr: Contrats à Terme sur l'Argent

source: Natural Gas Futures
es: Futuros de Gas Natural
fr: Contrats à Terme sur le Gaz Naturel

source: Gold Futures
es: Futuros de Oro
fr: Contrats à Terme sur l'Or

source: Nasdaq Composite Index
es: Índice Nasdaq Composite
fr: Indice Nasdaq Composite

source: Dow Jones Industrial Average
es: Promedio Industrial Dow Jones
fr: Moyenne Industrielle Dow Jones

source: Russell 2000 Index
es: Índice Russell 2000
fr: Indice Russell 2000

source: S&P 500 Index
es: Índice S&P 500
fr: Indice S&P 500

source: Select Symbol
es: Seleccionar Símbolo
fr: Sélectionner le Symbole

source: Chart Type
es: Tipo de Gráfico
fr: Type de Graphique

source: Short Term
es: Corto Plazo
fr: Court Terme

source: Short-Medium Term
es: Corto-Medio Plazo
fr: Court-Moyen Terme

source: Medium Term
es: Medio Plazo
fr: Moyen Terme

source: Medium-Long Term
es: Medio-Largo Plazo
fr: Moyen-Long Terme

source: Long Term
es: Largo Plazo
fr: Long Terme

source: No data found for this instrument, please select another one.
es: No se encontraron datos para este instrumento, por favor seleccione otro.
fr: Aucune donnée trouvée pour cet instrument, veuillez en sélectionner un autre.

source: No symbols found for this instrument, please select another one.
es: No se encontraron símbolos para este instrumento, por favor seleccione otro.
fr: Aucun symbole trouvé pour cet instrument, veuillez en sélectionner un autre.

source: Keep in mind, the longer the term, the stronger the signal. Focusing on Short Term only is a bit risky 🤫.
es: Tenga en cuenta que cuanto más largo sea el plazo, más fuerte será la señal. Centrarse solo en el corto plazo es un poco arriesgado 🤫.
fr: Gardez à l'esprit que plus le terme est long, plus le signal est fort. Se concentrer uniquement sur le court terme est un peu risqué 🤫.

source: Market is maintaining its upward momentum
es: El mercado mantiene su impulso alcista
fr: Le marché maintient son élan haussier

source: Market is slowing down
es: El mercado se está desacelerando
fr: Le marché ralentit

source: Market is losing its upward momentum
es: El mercado está perdiendo su impulso alcista
fr: Le marché perd son élan haussier

source: Market is consolidating
es: El mercado está consolidando
fr: Le marché se consolide

source: Optimistic
es: Optimista
fr: Optimiste

source: Pessimistic
es: Pesimista
fr: Pessimiste

source: Consolidating
es: Consolidando
fr: En Consolidation

source: Line Chart
es: Gráfico de Líneas
fr: Graphique en Ligne

source: Cumulative Return
es: Retorno Acumulado
fr: Rendement Cumulatif

source: Candlesticks
es: Velas
fr: Chandeliers

source: System Error, please try again later.
es: Error del Sistema, por favor intente más tarde.
fr: Erreur système, veuillez réessayer plus tard.

source: Condvest AI Advisor Chat
es: Chat del Asesor AI de Condvest
fr: Chat Conseiller IA Condvest

source: Ask me what is this about and how does it work?
es: ¿Pregúntame de qué se trata esto y cómo funciona?
fr: Demandez-moi de quoi il s'agit et comment ça fonctionne?

source: Type your question here and press Enter
es: Escriba su pregunta aquí y presione Enter
fr: Tapez votre question ici et appuyez sur Entrée

source: CondVest Pick 💰
es: Selección CondVest 💰
fr: Sélection CondVest 💰

source: Select Trading Term
es: Seleccionar Plazo de Operación
fr: Sélectionner la Durée de Trading

source: Worth a Try 💰
es: Vale la Pena Intentar 💰
fr: Ça Vaut le Coup 💰

source: Could be a bounce this week 💰
es: Podría haber un rebote esta semana 💰
fr: Possible rebond cette semaine 💰

source: No Opportunity found today, bored... 😴
es: No se encontraron oportunidades hoy, aburrido... 😴
fr: Aucune opportunité trouvée aujourd'hui, ennuyeux... 😴

source: 💰 Buy!
es: 💰 ¡Comprar!
fr: 💰 Acheter!

source: 💰 Possible Bounce!
es: 💰 ¡Posible Rebote!
fr: 💰 Rebond Possible!

source: Check How Much You Can Earn in a Week 🔍
es: Compruebe Cuánto Puede Ganar en una Semana 🔍
fr: Vérifiez Combien Vous Pouvez Gagner en une Semaine 🔍

source: Stock not found, do you want to contribute this stock to our database?
es: Acción no encontrada, ¿desea contribuir esta acción a nuestra base de datos?
fr: Action non trouvée, voulez-vous ajouter cette action à notre base de données?

source: Crypto not found, do you want to contribute this crypto to our database?
es: Cripto no encontrada, ¿desea contribuir esta cripto a nuestra base de datos?
fr: Crypto non trouvée, voulez-vous ajouter cette crypto à notre base de données?

source: Expected Earnings
es: Ganancias Esperadas
fr: Gains Attendus

source: Expected Loss
es: Pérdida Esperada
fr: Perte Attendue

source: Mid Term
es: Medio Plazo
fr: Moyen Terme

source: BUY
es: COMPRAR
fr: ACHETER

source: SELL
es: VENDER
fr: VENDRE

source: Sorry, this stock is not available on Market, is it a typo?
es: Lo siento, esta acción no está disponible en el Mercado, ¿es un error tipográfico?
fr: Désolé, cette action n'est pas disponible sur le Marché, est-ce une erreur de frappe?

source: Sorry, this crypto is not available on Market, is it a typo?
es: Lo siento, esta cripto no está disponible en el Mercado, ¿es un error tipográfico?
fr: Désolé, cette crypto n'est pas disponible sur le Marché, est-ce une erreur de frappe?

source: Portfolio Analytics Report
es: Informe Analítico de Cartera
fr: Rapport d'Analyse du Portefeuille

source: Dear user, you don't have any portfolio yet, you can add one by navigating to EDIT PORTFOLIO in the sidebar.
es: Estimado usuario, aún no tiene ninguna cartera, puede agregar una navegando a EDITAR CARTERA en la barra lateral.
fr: Cher utilisateur, vous n'avez pas encore de portefeuille, vous pouvez en ajouter un en naviguant vers MODIFIER LE PORTEFEUILLE dans la barre latérale.

source: We will leverage data-driven approach and AI to monitor and analyze your portfolio in Real-Time!!
es: ¡Utilizaremos un enfoque basado en datos e IA para monitorear y analizar su cartera en Tiempo Real!
fr: Nous utiliserons une approche basée sur les données et l'IA pour surveiller et analyser votre portefeuille en temps réel!!

source: Long Term Alert Dashboard
es: Panel de Alertas a Largo Plazo

source: Search Stock
es: Buscar Acción
fr: Rechercher une Action

source: Loading data...
es: Cargando datos...
fr: Chargement des données...

source: Key Price Areas
es: Áreas de Precio Clave
fr: Zones de Prix Clés

source: Key Price Points
es: Puntos de Precio Clave
fr: Points de Prix Clés

source: Most Trading Areas
es: Áreas de Mayor Negociación
fr: Zones de Trading Principales

source: Momentum
es: Impulso

source: Support/Resistance
es: Soporte/Resistencia
fr: Support/Résistance

source: Up Trend Strength
es: Fuerza de Tendencia Alcista
fr: Force de la Tendance Haussière

source: No Alert
es: Sin Alerta
fr: Aucune Alerte

source: Accelerating
es: Acelerando
fr: En Accélération

source: Decelerating
es: Desacelerando
fr: En Décélération

source: Support
es: Soporte

source: Resistance
es: Resistencia
fr: Résistance

source: Loss
es: Pérdida
fr: Perte

source: Negotiating
es: Negociando
fr: En Négociation

source: Weakened
es: Debilitado
fr: Affaibli

source: Maintained
es: Mantenido
fr: Maintenu

source: Add Stock to Portfolio
es: Agregar Acción a la Cartera
fr: Ajouter une Action au Portefeuille

source: Delete Stock from Portfolio
es: Eliminar Acción de la Cartera
fr: Supprimer une Action du Portefeuille

source: ➕ Add to Portfolio
es: ➕ Agregar a la Cartera
fr: ➕ Ajouter au Portefeuille

source: 🗑️ Delete from Portfolio
es: 🗑️ Eliminar de la Cartera
fr: 🗑️ Supprimer du Portefeuille

source: Enter the stock to delete from portfolio:
es: Ingrese la acción a eliminar de la cartera:
fr: Entrez l'action à supprimer du portefeuille:

source: Short Term Alerts Dashboard
es: Panel de Alertas a Corto Plazo
fr: Tableau de Bord des Alertes Court Terme

source: 💰 Enter Average Price:
es: 💰 Ingrese Precio Promedio:
fr: 💰 Entrez le Prix Moyen:

source: 📈 Enter Number of Shares:
es: 📈 Ingrese Número de Acciones:
fr: 📈 Entrez le Nombre d'Actions:

source: 🔍 Search Stock:
es: 🔍 Buscar Acción:
fr: 🔍 Rechercher une Action:

source: Enter stock symbol...
es: Ingrese símbolo de la acción...
fr: Entrez le symbole de l'action...

source: 🎉 Thanks for your contribution! Your stock will be added to the database tomorrow.
es: 🎉 ¡Gracias por su contribución! Su acción será agregada a la base de datos mañana.
fr: 🎉 Merci pour votre contribution! Votre action sera ajoutée à la base de données demain.

source: 😔 Sorry, Stock not found in database
es: 😔 Lo siento, Acción no encontrada en la base de datos
fr: 😔 Désolé, Action non trouvée dans la base de données

source: 🤔 Would you like to contribute this stock to our database?
es: 🤔 ¿Le gustaría contribuir esta acción a nuestra base de datos?
fr: 🤔 Souhaitez-vous ajouter cette action à notre base de données?

source: e.g. 150.50
es: ej. 150.50
fr: ex: 150.50

source: e.g. 100
es: ej. 100
fr: ex: 100

source: Portfolio is Empty
es: La Cartera está Vacía
fr: Le Portefeuille est Vide

source: No Alert Time Available
es: No Hay Tiempo de Alerta Disponible
fr: Aucun Horaire d'Alerte Disponible

source: No Alert Yet
es: Sin Alertas Aún
fr: Pas Encore d'Alerte

source: Experience CondVest without an account!!
es: ¡Experimente CondVest sin una cuenta!!
fr: Experience CondVest sans un compte!!

source: CondVest AI Advisor Chat
es: Chat del Asesor AI de Condvest

source: Stock Indepth Dashboard
es: Panel de Análisis Profundo de Acciones
fr: Tableau de Bord d'Analyse Approfondie

source: Sector
fr: Secteur

source: Neutral
fr: Neutre

source: AI Market Analysis
fr: Analyse de Marché IA

source: Ask about market conditions, trends, or specific symbols...
fr: Demandez-moi des conditions de marché, des tendances ou des symboles spécifiques...
